<a href="https://colab.research.google.com/github/blazaropinto/PDA_Data_Analysis_Python/blob/main/Data_Investigation_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data investigation project
---

Use what you have learnt so far about reading data files and displaying rows, columns, unique values, etc, to investigate and produce some printed information from this data set: https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv

In [6]:
import pandas as pd

url = 'https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv'

df = pd.read_csv(url)

df.head(5)

        code                  area  ... no_of_houses  borough_flag
0  E09000001        city of london  ...          NaN             1
1  E09000002  barking and dagenham  ...          NaN             1
2  E09000003                barnet  ...          NaN             1
3  E09000004                bexley  ...          NaN             1
4  E09000005                 brent  ...          NaN             1

[5 rows x 12 columns]

Create a function to get aa list of the unique values and its length, as a tuple, for the column passed as an argument. Then use it to print the number of unique values and the first 4 values for each column of the dataframe if the number of values is less than 10% of the records in the dataframe.

In [10]:
def col_unique_values(col):
  list_unique = df[col].unique()
  n_unique = len(list_unique)
  return list_unique, n_unique


for col in df.columns:
  value_tuple = col_unique_values(col)
  if value_tuple[1] < 0.1 * df.shape[0]:
    print('Column name', col, 'has', value_tuple[1], 'different values')
    for val in value_tuple[0][:5]:
      print(val) 
    print('\n')

Column name code has 51 different values
E09000001
E09000002
E09000003
E09000004
E09000005


Column name area has 51 different values
city of london
barking and dagenham
barnet
bexley
brent


Column name date has 21 different values
1999-12-01
2000-12-01
2001-12-01
2002-12-01
2003-12-01


Column name life_satisfaction has 83 different values
nan
7.05
7.43
7.42
7.11


Column name recycling_pct has 58 different values
0
3
8
18
6


Column name area_size has 38 different values
nan
315.0
3780.0
8675.0
6429.0


Column name borough_flag has 2 different values
1
0

Get the **mean population** for each area

In [18]:
for area in df.area.unique():
  print(area, ':', round(df[df.area == area].population_size.mean(), 1))

city of london : 7597.8
barking and dagenham : 181344.2
barnet : 347784.2
bexley : 229733.7
brent : 295151.2
bromley : 308856.3
camden : 219415.7
croydon : 355372.5
ealing : 325586.3
enfield : 302169.4
greenwich : 246124.3
hackney : 236760.4
hammersmith and fulham : 175965.0
haringey : 246020.7
harrow : 230408.9
havering : 236010.1
hillingdon : 269174.7
hounslow : 241772.0
islington : 200492.7
kensington and chelsea : 159658.1
kingston upon thames : 159309.1
lambeth : 295154.7
lewisham : 271949.6
merton : 196748.1
newham : 289119.7
redbridge : 269373.6
richmond upon thames : 184840.2
southwark : 280339.0
sutton : 189319.4
tower hamlets : 244909.3
waltham forest : 246499.7
wandsworth : 295577.5
westminster : 221786.6
north east : 2582039.8
north west : 6987323.3
yorkshire and the humber : 5176862.7
east midlands : 4455858.7
west midlands : 5529304.0
east : 5746916.1
london : 7960324.8
south east : 8489419.6
south west : 5220982.3
inner london : 3144746.8
outer london : 4815578.0
england : 52177832.4
united kingdom : 62198313.6
great britain : 60420712.4
england and wales : 55197832.9
northern ireland : 1777577.1
scotland : 5222879.5
wales : 3020000.5